app/controllers/api/v2/calendars_controller.rb

            def index
                per_page = 25
                cur_page = 1
                if params.has_key?(:per_page)
                    per_page = params[:per_page]
                end
                if params.has_key?(:page)
                    cur_page = params[:page]
                end
                query = @user.calendars.includes(:feed)

                #render json: query.paginate(page: cur_page,per_page: per_page)
                @calendars = query.paginate(page: cur_page,per_page: per_page)
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."user_id" = ?  ORDER BY "calendars"."created_at" DESC LIMIT 25 OFFSET 0  [["user_id", 1]]