app/controllers/api/v2/feeds_controller.rb

            def show
                feed = Feed.find_by(id: params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ?  ORDER BY "feeds"."created_at" DESC LIMIT 1  [["id", 1]]

            def create
                if @user
                    new_feed = @user.feeds.build(feed_params)
                    if new_feed.save
---
INSERT INTO "feeds" ("feed_type", "available", "user_id", "created_at", "updated_at", "status", "up") VALUES (?, ?, ?, ?, ?, ?, ?)  [["feed_type", 1], ["available", ""], ["user_id", 1], ["created_at", "2016-07-13 23:04:47.262999"], ["updated_at", "2016-07-13 23:04:47.262999"], ["status", 1], ["up", 0]]

            def destroy

                feed = Feed.find_by(id: params[:id])
                logger.info feed.inspect
                if feed
                    if(feed.user.same?(@user))
                        feed.destroy
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ?  ORDER BY "feeds"."created_at" DESC LIMIT 1  [["id", 1]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 1]]

            def entries
                per_page = 25
                cur_page = 1
                if params.has_key?(:per_page)
                    per_page = params[:per_page]
                end
                if params.has_key?(:page)
                    cur_page = params[:page]
                end
                query = nil
                if authenticated?
                    #include？
                    #query = Feed.joins(:user).select(:id,:feed_type,:start_time,:start_place,:end_place,:end_time,:available,:user_id,'users.name as user_name')
                    query = Feed.includes(:user).references(:user)
                else
                    #TODO: plunk?
                    query = Feed.select(:id,:feed_type,:start_time,:start_place,:end_place,:end_time,:available)
                end

                #render json: query.paginate(page: cur_page,per_page: per_page)
                @feeds = query.paginate(page: cur_page,per_page: per_page)
---
SELECT "feeds".* FROM "feeds" INNER JOIN "users" ON "users"."id" = "feeds"."user_id"  ORDER BY "feeds"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2, 1)
SELECT  "feeds"."id", "feeds"."feed_type", "feeds"."start_time", "feeds"."start_place", "feeds"."end_place", "feeds"."end_time", "feeds"."available" FROM "feeds"  ORDER BY "feeds"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "feeds"