app/controllers/api/v2/feeds_controller.rb

SELECT  "feeds"."id", "feeds"."feed_type", "feeds"."start_time", "feeds"."start_place", "feeds"."feed_content" FROM "feeds"  ORDER BY "feeds"."created_at" DESC LIMIT 25 OFFSET 0
---
            def entries
                per_page = 25
                cur_page = 1
                if params.has_key?(:per_page)
                    per_page = params[:per_page]
                end
                if params.has_key?(:page)
                    cur_page = params[:page]
                end
                query = nil
                if authenticated?
                    #include？
                    #query = Feed.joins(:user).select(:id,:feed_type,:start_time,:start_place,:end_place,:end_time,:available,:user_id,'users.name as user_name')
                    query = Feed.includes(:user).references(:user)
                else
                    #TODO: plunk?
                    query = Feed.select(:id,:feed_type,:start_time,:start_place,:feed_content)
                end

                #render json: query.paginate(page: cur_page,per_page: per_page)
                @feeds = query.paginate(page: cur_page,per_page: per_page)