app/controllers/api/v2/feeds_controller.rb

            def show
                feed = Feed.find_by(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE (1)  ORDER BY "feeds"."created_at" DESC LIMIT 1

            def destroy
                cur_user = current_user
                if cur_user
                    feed = Feed.find_by(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE (1)  ORDER BY "feeds"."created_at" DESC LIMIT 1