app/controllers/api/v2/in_site_messages_controller.rb

        def index
                per_page = 25
                cur_page = 1
                if params.has_key?(:per_page)
                    per_page = params[:per_page]
                end
                if params.has_key?(:page)
                    cur_page = params[:page]
                end

                query = InSiteMessage.includes(:sender,:receiver).where("sender_id=:user_id OR receiver_id=:user_id",user_id:@user.id)
                @messages = query.paginate(page: cur_page,per_page: per_page)
---
SELECT  "in_site_messages".* FROM "in_site_messages" WHERE (sender_id=1 OR receiver_id=1)  ORDER BY "in_site_messages"."created_at" DESC LIMIT 25 OFFSET 0

        def create
            @new_msg = @user.sending_messages.build(msg_params)
            logger.info @new_msg
            if @new_msg.save
                if @new_msg.msg_type == InSiteMessage::TYPE_ACCEPT_FRIEND
                    @new_msg.receiver.add_friend(@new_msg.sender)
                    @request_msg = @user.receiving_messages.where("msg_type=1 and sender_id=:receiver_id",receiver_id: @new_msg.receiver_id).first
                    if @request_msg
                        @request_msg.update_attribute(:status, InSiteMessage::STATUS_READ)
---
SELECT  "in_site_messages".* FROM "in_site_messages" WHERE "in_site_messages"."receiver_id" = ? AND (msg_type=InSiteMessage::TYPE_REQUEST_FRIEND and sender_id=1)  ORDER BY "in_site_messages"."created_at" DESC LIMIT 1  [["receiver_id", 3]]
UPDATE "in_site_messages" SET "status" = ?, "updated_at" = ? WHERE "in_site_messages"."id" = ?  [["status", 16], ["updated_at", "2016-09-29 00:56:21.720830"], ["id", 19]]