app/controllers/api/v2/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        def create
            @freind = User.find_by(id: params[:freind_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        def destroy
            @freind = User.find_by(id: params[:freind_id])