app/controllers/api/v2/users_controller.rb

      def show
        @found_user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

      def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "token_digest") VALUES (?, ?, ?, ?, ?, ?)

      def login
        if(params.has_key?(:email) && params.has_key?(:password))
          @user = User.find_by(email: params[:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "example@railstutorial.org"]]

      def friends
        #TODO it is not best practise?
        @friends = @user.active_relationship.includes(:positive_user) + @user.positive_relationship.includes(:user)
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."positive_user_id" = ?  [["positive_user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."positive_user_id" WHERE "relationships"."user_id" = ?  [["user_id", 1]]

      def add_friend
        @friend = User.find_by(id: params[:friend_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]