app/controllers/api/v2/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
      def add_freind
        @freind = User.find_by(id: params[:freind_id])